{
  "slug": "ibudget-waiver",
  "category": "scholarship",
  "title": "iBudget Waiver",
  "shortDescription": "Florida's Medicaid waiver providing individualized budgets for home and community-based services for individuals with developmental disabilities including autism.",
  "description": "The iBudget (Individual Budgeting) Waiver is Florida's primary Medicaid Home and Community-Based Services (HCBS) waiver for individuals with developmental disabilities, including autism spectrum disorder. Officially known as the FL Developmental Disabilities Individual Budgeting Waiver (0867.R03.00), it provides an individualized budget based on each person's assessed needs, allowing recipients to choose services and providers that best meet their requirements. The waiver is administered by the Agency for Persons with Disabilities (APD) and operates under Section 1915(c) authority with concurrent 1915(j) self-direction authority. Unlike traditional fee-for-service Medicaid, iBudget gives families flexibility to direct their own services within their allocated budget.",
  "coveredServices": [
    "Life Skills Development Level 1 - Companion",
    "Life Skills Development Level 2 - Supported Employment",
    "Life Skills Development Level 3 - Adult Day Training",
    "Life Skills Development Level 4 - Prevocational Services",
    "Residential Habilitation",
    "Respite Care",
    "Support Coordination",
    "Adult Dental Services",
    "Occupational Therapy",
    "Physical Therapy",
    "Respiratory Therapy",
    "Skilled Nursing",
    "Specialized Medical Equipment and Supplies",
    "Specialized Mental Health Counseling",
    "Speech Therapy",
    "Transportation",
    "Behavior Analysis Services (ABA)",
    "Behavior Assistant Services",
    "Dietitian Services",
    "Environmental Accessibility Adaptations",
    "Personal Emergency Response System",
    "Personal Supports",
    "Private Duty Nursing",
    "Residential Nursing",
    "Special Medical Home Care",
    "Supported Living Coaching Services"
  ],
  "eligibility": [
    "Florida resident",
    "Diagnosis of developmental disability (including autism spectrum disorder, intellectual disability, cerebral palsy, spina bifida, Prader-Willi syndrome, or similar conditions)",
    "Disability must have manifested before age 18",
    "Must meet ICF/IID (Intermediate Care Facility for Individuals with Intellectual Disabilities) level of care",
    "Age 3 or older",
    "Meet Medicaid financial eligibility requirements",
    "Must be enrolled with the Agency for Persons with Disabilities (APD)"
  ],
  "howToApply": [
    "Contact your local APD regional office to begin the application process",
    "Complete the APD application for services",
    "Undergo eligibility determination including developmental disability verification",
    "If eligible, you will be placed on the waitlist (wait times vary significantly by region)",
    "Once a slot becomes available, complete the enrollment process",
    "Work with your Waiver Support Coordinator to develop your person-centered support plan",
    "Choose your service providers and begin receiving services"
  ],
  "benefits": [
    "Individualized budget based on your specific assessed needs",
    "Flexibility to choose your own service providers",
    "Self-direction option (CDC+) allows you to manage your own budget",
    "Covers services not available through regular Medicaid",
    "Supports living in your home and community rather than institutional settings",
    "Comprehensive range of therapies including ABA, speech, OT, and PT",
    "Environmental modifications to make your home accessible",
    "Respite care to give family caregivers a break",
    "Transportation to medical appointments and community activities",
    "Employment support services for adults"
  ],
  "importantNotes": [
    "There is typically a waitlist due to high demand - wait times can be several years",
    "Budget amounts are determined by an algorithm based on assessed needs",
    "Services must be included in your approved support plan",
    "Annual re-evaluations are required to maintain eligibility",
    "You can choose traditional waiver services or the CDC+ self-direction option",
    "Control Number: FL-0867.R03.00"
  ],
  "links": [
    {
      "label": "Agency for Persons with Disabilities (APD)",
      "url": "https://apd.myflorida.com/",
      "description": "Florida state agency that administers the iBudget waiver program"
    },
    {
      "label": "Florida Medicaid",
      "url": "https://ahca.myflorida.com/",
      "description": "Agency for Health Care Administration - administers Florida's Medicaid program"
    },
    {
      "label": "Medicaid.gov",
      "url": "https://www.medicaid.gov/",
      "description": "Federal Medicaid information and resources"
    }
  ],
  "contactInfo": {
    "agency": "Agency for Persons with Disabilities",
    "department": "Waiver Policy and Enrollment",
    "address": "4030 Esplanade Way, Tallahassee, FL 32399",
    "phone": "(850) 414-8871",
    "website": "https://apd.myflorida.com/"
  }
}
