{
  "slug": "ftc",
  "category": "scholarships",
  "title": "Florida Tax Credit Scholarship (FTC)",
  "shortDescription": "Corporate tax credit-funded scholarship providing private school tuition assistance.",
  "description": "The Florida Tax Credit Scholarship (FTC) program provides scholarships to eligible low-income Florida students to attend participating private schools. Funded through corporate donations that receive tax credits, this program has helped hundreds of thousands of Florida students access private education. While not autism-specific, many families of children with autism utilize FTC scholarships to attend private schools that offer smaller class sizes, individualized attention, or specialized programs.",
  "benefits": [
    "Covers private school tuition",
    "Transportation assistance available",
    "Wide range of participating private schools",
    "No prior public school enrollment required",
    "Renewable annually"
  ],
  "eligibility": "Student must be a Florida resident entering kindergarten through 12th grade. Family income must meet program guidelines (generally at or below 400% of federal poverty level). Priority given to students with prior FTC scholarships and those from lowest income families.",
  "howToApply": "Apply through Step Up For Students or AAA Scholarship Foundation. Applications require proof of household income, Florida residency, and student eligibility documentation.",
  "links": [
    {
      "label": "Step Up For Students",
      "url": "https://www.stepupforstudents.org/",
      "description": "Primary scholarship funding organization - apply and manage your scholarship"
    },
    {
      "label": "AAA Scholarship Foundation",
      "url": "https://www.aaascholarships.org/",
      "description": "Alternative scholarship funding organization for FTC"
    },
    {
      "label": "Florida Department of Education",
      "url": "https://www.fldoe.org/",
      "description": "Official state education agency with scholarship program information"
    }
  ]
}
